avr-rust/avrd/packs/xmegae/ATxmega8E5.atdf
          </instance>
        </module>
        <module name="XCL" id="I3008">
          <instance name="XCL">
            <register-group address-space="data" offset="0x0460" name-in-module="XCL" name="XCL"/>
            <signals>
              <signal function="XCLIN_LSB_PC" group="IN" index="1" pad="PC0"/>
              <signal function="XCLIN_LSB_PC" group="IN" index="2" pad="PC1"/>
              <signal function="XCLIN_LSB_PC" group="IN" index="0" pad="PC2"/>
              <signal function="XCLIN_LSB_PC" group="IN" index="3" pad="PC3"/>
              <signal function="XCLIN_MSB_PC" group="IN" index="1" pad="PC4"/>
              <signal function="XCLIN_MSB_PC" group="IN" index="2" pad="PC5"/>
              <signal function="XCLIN_MSB_PC" group="IN" index="0" pad="PC6"/>
              <signal function="XCLIN_MSB_PC" group="IN" index="3" pad="PC7"/>
              <signal function="XCLIN_LSB_PD" group="IN" index="1" pad="PD0"/>
              <signal function="XCLIN_LSB_PD" group="IN" index="2" pad="PD1"/>
              <signal function="XCLIN_LSB_PD" group="IN" index="0" pad="PD2"/>
              <signal function="XCLIN_LSB_PD" group="IN" index="3" pad="PD3"/>
              <signal function="XCLIN_MSB_PD" group="IN" index="1" pad="PD4"/>
              <signal function="XCLIN_MSB_PD" group="IN" index="2" pad="PD5"/>
              <signal function="XCLIN_MSB_PD" group="IN" index="0" pad="PD6"/>
              <signal function="XCLIN_MSB_PD" group="IN" index="3" pad="PD7"/>
              <signal function="XCLOUT_LSB_PC" group="OUT" index="0" pad="PC0"/>
              <signal function="XCLOUT_MSB_PC" group="OUT" index="0" pad="PC4"/>
              <signal function="XCLOUT_LSB_PD" group="OUT" index="0" pad="PD0"/>
              <signal function="XCLOUT_LSB_PD" group="OUT" index="0" pad="PD4"/>
              <signal function="XCL_OCOUT" group="OC" index="0" pad="PD2"/>
              <signal function="XCL_OCOUT" group="OC" index="1" pad="PD3"/>
            </signals>
          </instance>
        </module>
        <module name="TWI" id="I6089" version="XMEGAE">
          <instance name="TWIC">
            <register-group address-space="data" offset="0x480" name-in-module="TWI" name="TWIC"/>
            <signals>
              <signal function="TWI" group="SDA" pad="PC0"/>
              <signal function="TWI" group="SCL" pad="PC1"/>
              <signal function="TWI_BRIDGE" group="SDA" pad="PD0"/>
              <signal function="TWI_BRIDGE" group="SCL" pad="PD1"/>
            </signals>
          </instance>
        </module>
        <module name="PORT" id="I6075" version="XMEGAE">
          <instance name="PORTA">
            <register-group address-space="data" offset="0x0600" name-in-module="PORT" name="PORTA"/>
            <signals>
              <signal function="PORTA" group="P" index="0" pad="PA0"/>
              <signal function="PORTA" group="P" index="1" pad="PA1"/>
              <signal function="PORTA" group="P" index="2" pad="PA2"/>
              <signal function="PORTA" group="P" index="3" pad="PA3"/>
              <signal function="PORTA" group="P" index="4" pad="PA4"/>
              <signal function="PORTA" group="P" index="5" pad="PA5"/>
              <signal function="PORTA" group="P" index="6" pad="PA6"/>
              <signal function="PORTA" group="P" index="7" pad="PA7"/>
            </signals>
          </instance>
          <instance name="PORTC">
            <register-group address-space="data" offset="0x0640" name-in-module="PORT" name="PORTC"/>
            <signals>
              <signal function="PORTC" group="P" index="0" pad="PC0"/>
              <signal function="PORTC" group="P" index="1" pad="PC1"/>
              <signal function="PORTC" group="P" index="2" pad="PC2"/>
              <signal function="PORTC" group="P" index="3" pad="PC3"/>
              <signal function="PORTC" group="P" index="4" pad="PC4"/>
              <signal function="PORTC" group="P" index="5" pad="PC5"/>
              <signal function="PORTC" group="P" index="6" pad="PC6"/>
              <signal function="PORTC" group="P" index="7" pad="PC7"/>
            </signals>
          </instance>
          <instance name="PORTD">
            <register-group address-space="data" offset="0x0660" name-in-module="PORT" name="PORTD"/>
            <signals>
              <signal function="PORTD" group="P" index="0" pad="PD0"/>
              <signal function="PORTD" group="P" index="1" pad="PD1"/>
              <signal function="PORTD" group="P" index="2" pad="PD2"/>
              <signal function="PORTD" group="P" index="3" pad="PD3"/>
              <signal function="PORTD" group="P" index="4" pad="PD4"/>
              <signal function="PORTD" group="P" index="5" pad="PD5"/>
              <signal function="PORTD" group="P" index="6" pad="PD6"/>
              <signal function="PORTD" group="P" index="7" pad="PD7"/>
            </signals>
          </instance>
          <instance name="PORTR">
            <register-group address-space="data" offset="0x07E0" name-in-module="PORT" name="PORTR"/>
            <signals>
              <signal function="PORTR" group="P" index="0" pad="PR0"/>
              <signal function="PORTR" group="P" index="1" pad="PR1"/>
            </signals>
          </instance>
        </module>
        <module name="TC" id="I3007" version="XMEGAE">
          <instance name="TCC4">
            <register-group address-space="data" offset="0x800" name-in-module="TC4" name="TCC4"/>
            <signals>
              <signal field="TC4A" function="TC4" group="OC4A" pad="PC0"/>
              <signal field="TC4B" function="TC4" group="OC4B" pad="PC1"/>
              <signal field="TC4C" function="TC4" group="OC4C" pad="PC2"/>
              <signal field="TC4D" function="TC4" group="OC4D" pad="PC3"/>
              <signal field="TC4A" function="TC4_ALT" group="OC4A" pad="PC4"/>
              <signal field="TC4B" function="TC4_ALT" group="OC4B" pad="PC5"/>
              <signal field="TC4C" function="TC4_ALT" group="OC4C" pad="PC6"/>
              <signal field="TC4D" function="TC4_ALT" group="OC4D" pad="PC7"/>
            </signals>
          </instance>
          <instance name="TCC5">
            <register-group address-space="data" offset="0x840" name-in-module="TC5" name="TCC5"/>
            <signals>
              <signal function="TC5" group="OC5A" pad="PC4"/>
              <signal function="TC5" group="OC5B" pad="PC5"/>
            </signals>
          </instance>
