avr-rust/avrd/packs/xmegae/ATxmega8E5.atdf
          <instance name="TCD5">
            <register-group address-space="data" offset="0x940" name-in-module="TC5" name="TCD5"/>
            <signals>
              <signal function="TC5" group="OC5A" pad="PD4"/>
              <signal function="TC5" group="OC5B" pad="PD5"/>
            </signals>
          </instance>
        </module>
        <module name="FAULT" id="I3620" version="XMEGAE">
          <instance name="FAULTC4">
            <register-group address-space="data" offset="0x880" name-in-module="FAULT" name="FAULTC4"/>
          </instance>
          <instance name="FAULTC5">
            <register-group address-space="data" offset="0x890" name-in-module="FAULT" name="FAULTC5"/>
          </instance>
        </module>
        <module name="WEX" id="I3007" version="XMEGAE">
          <instance name="WEXC">
            <register-group address-space="data" offset="0x8A0" name-in-module="WEX" name="WEXC"/>
            <signals>
              <signal function="WEX" group="OC4ALS" pad="PC0"/>
              <signal function="WEX" group="OC4AHS" pad="PC1"/>
              <signal function="WEX" group="OC4BLS" pad="PC2"/>
              <signal function="WEX" group="OC4BHS" pad="PC3"/>
              <signal function="WEX" group="OC4CLS" pad="PC4"/>
              <signal function="WEX" group="OC4CHS" pad="PC5"/>
              <signal function="WEX" group="OC4DLS" pad="PC6"/>
              <signal function="WEX" group="OC4DHS" pad="PC7"/>
            </signals>
          </instance>
        </module>
        <module name="HIRES" id="I3620" version="XMEGAE">
          <instance name="HIRESC">
            <register-group address-space="data" offset="0x8B0" name-in-module="HIRES" name="HIRESC"/>
          </instance>
        </module>
        <module name="USART" id="I4000" version="XMEGAE">
          <instance name="USARTC0">
            <register-group address-space="data" offset="0x8C0" name-in-module="USART" name="USARTC0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PC1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PC2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PC3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PC5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PC6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PC7"/>
            </signals>
          </instance>
          <instance name="USARTD0">
            <register-group address-space="data" offset="0x9C0" name-in-module="USART" name="USARTD0"/>
            <signals>
              <signal field="USART0" function="USART" group="XCK" pad="PD1"/>
              <signal field="USART0" function="USART" group="RXD" pad="PD2"/>
              <signal field="USART0" function="USART" group="TXD" pad="PD3"/>
              <signal field="USART0" function="USART_ALT" group="XCK" pad="PD5"/>
              <signal field="USART0" function="USART_ALT" group="RXD" pad="PD6"/>
              <signal field="USART0" function="USART_ALT" group="TXD" pad="PD7"/>
            </signals>
          </instance>
        </module>
        <module name="SPI" id="I6090" version="XMEGAE">
          <instance name="SPIC">
            <register-group address-space="data" offset="0x08E0" name-in-module="SPI" name="SPIC"/>
            <signals>
              <signal function="SPI" group="SS" pad="PC4"/>
              <signal function="SPI" group="MOSI" pad="PC5"/>
              <signal function="SPI" group="MISO" pad="PC6"/>
              <signal function="SPI" group="SCK" pad="PC7"/>
            </signals>
          </instance>
        </module>
        <module name="IRCOM" id="I6090" version="XMEGAAU">
          <instance name="IRCOM">
            <register-group address-space="data" offset="0x8F8" name-in-module="IRCOM" name="IRCOM"/>
          </instance>
        </module>
        <module name="FUSE" id="I3620" version="XMEGAE">
          <instance name="FUSE">
            <register-group address-space="fuses" offset="0x00" name-in-module="NVM_FUSES" name="FUSE"/>
          </instance>
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" offset="0x00" name-in-module="NVM_LOCKBITS" name="LOCKBIT"/>
          </instance>
        </module>
        <module name="SIGROW" id="I3620" version="XMEGAE">
          <instance name="PROD_SIGNATURES">
            <register-group address-space="prod_signatures" offset="0x00" name-in-module="NVM_PROD_SIGNATURES" name="PROD_SIGNATURES"/>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt-group index="1" module-instance="OSC" name-in-module="OSC"/>
        <interrupt-group index="2" module-instance="PORTR" name-in-module="PORT"/>
        <interrupt-group index="3" module-instance="EDMA" name-in-module="EDMA"/>
        <interrupt-group index="7" module-instance="RTC" name-in-module="RTC"/>
        <interrupt-group index="9" module-instance="PORTC" name-in-module="PORT"/>
        <interrupt-group index="10" module-instance="TWIC" name-in-module="TWI"/>
        <interrupt-group index="12" module-instance="TCC4" name-in-module="TC4"/>
        <interrupt-group index="18" module-instance="TCC5" name-in-module="TC5"/>
        <interrupt-group index="22" module-instance="SPIC" name-in-module="SPI"/>
        <interrupt-group index="23" module-instance="USARTC0" name-in-module="USART"/>
        <interrupt-group index="26" module-instance="NVM" name-in-module="NVM"/>
        <interrupt-group index="28" module-instance="XCL" name-in-module="XCL"/>
        <interrupt-group index="30" module-instance="PORTA" name-in-module="PORT"/>
        <interrupt-group index="31" module-instance="ACA" name-in-module="AC"/>
        <interrupt-group index="34" module-instance="ADCA" name-in-module="ADC"/>
        <interrupt-group index="35" module-instance="PORTD" name-in-module="PORT"/>
        <interrupt-group index="36" module-instance="TCD5" name-in-module="TC5"/>
        <interrupt-group index="40" module-instance="USARTD0" name-in-module="USART"/>
      </interrupts>
      <interfaces>
        <interface type="pdi" name="PDI"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="SIGNATURE0" value="0x1E"/>
          <property name="SIGNATURE1" value="0x93"/>
          <property name="SIGNATURE2" value="0x41"/>
        </property-group>
        <property-group name="PDI_INTERFACE">
          <property name="APP_SECTION_OFFSET" value="0x00800000"/>
          <property name="APPTABLE_SECTION_OFFSET" value="0x00801800"/>
          <property name="BOOT_SECTION_OFFSET" value="0x00802000"/>
          <property name="DATAMEM_OFFSET" value="0x01000000"/>
          <property name="EEPROM_OFFSET" value="0x008C0000"/>
          <property name="USER_SIGNATURES_OFFSET" value="0x008E0400"/>
          <property name="PROD_SIGNATURES_OFFSET" value="0x008E0200"/>
          <property name="FUSE_REGISTERS_OFFSET" value="0x008F0020"/>
          <property name="LOCK_REGISTERS_OFFSET" value="0x008F0027"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="GPIO" id="I6085" version="XMEGAD" caption="General Purpose IO">
      <register-group caption="General Purpose IO Registers" name="GPIO" size="4">
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x00" size="1"/>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x01" size="1"/>
