avr-rust/avrd/packs/xmegae/ATxmega8E5.atdf
        <register caption="Compare Register Low" name="CMPL" offset="0x0C" size="1">
          <bitfield caption="TC16 Compare Low Byte" mask="0xFF" name="CMPL"/>
          <bitfield caption="BTC0 Compare Byte" mask="0xFF" name="BCMP0"/>
        </register>
        <register caption="Compare Register High" name="CMPH" offset="0x0D" size="1">
          <bitfield caption="TC16 Compare High Byte" mask="0xFF" name="CMPH"/>
          <bitfield caption="BTC1 Compare Byte" mask="0xFF" name="BCMP1"/>
        </register>
        <register caption="Period or Capture Register Low" name="PERCAPTL" offset="0x0E" size="1">
          <bitfield caption="TC16 Low Byte Period" mask="0xFF" name="PERL"/>
          <bitfield caption="TC16 Capture Value Low Byte" mask="0xFF" name="CAPTL"/>
          <bitfield caption="BTC0 Period" mask="0xFF" name="BPER0"/>
          <bitfield caption="BTC0 Capture Value Byte" mask="0xFF" name="BCAPT0"/>
        </register>
        <register caption="Period or Capture Register High" name="PERCAPTH" offset="0x0F" size="1">
          <bitfield caption="TC16 High Byte Period" mask="0xFF" name="PERH"/>
          <bitfield caption="TC16 Capture Value High Byte" mask="0xFF" name="CAPTH"/>
          <bitfield caption="BTC1 Period" mask="0xFF" name="BPER1"/>
          <bitfield caption="BTC1 Capture Value Byte" mask="0xFF" name="BCAPT1"/>
        </register>
      </register-group>
      <value-group caption="LUT0 Output Enable" name="XCL_LUT0OUTEN">
        <value caption="LUT0 output disabled" name="DISABLE" value="0x00"/>
        <value caption="LUT0 Output to pin 0" name="PIN0" value="0x01"/>
        <value caption="LUT0 Output to pin 4" name="PIN4" value="0x02"/>
      </value-group>
      <value-group caption="Port Selection" name="XCL_PORTSEL">
        <value caption="Port C for LUT or USARTC0 for PEC" name="PC" value="0x00"/>
        <value caption="Port D for LUT or USARTD0 for PEC" name="PD" value="0x01"/>
      </value-group>
      <value-group caption="LUT Configuration" name="XCL_LUTCONF">
        <value caption="2-Input two LUT" name="2LUT2IN" value="0x00"/>
        <value caption="Two LUT with duplicated input " name="2LUT1IN" value="0x01"/>
        <value caption="Two LUT with one common input " name="2LUT3IN" value="0x02"/>
        <value caption="3-Input LUT " name="1LUT3IN" value="0x03"/>
        <value caption="One LUT Mux " name="MUX" value="0x04"/>
        <value caption="One D-Latch LUT " name="DLATCH" value="0x05"/>
        <value caption="One RS-Latch LUT " name="RSLATCH" value="0x06"/>
        <value caption="One DFF LUT " name="DFF" value="0x07"/>
      </value-group>
      <value-group caption="Input Selection" name="XCL_INSEL">
        <value caption="Event system selected as source" name="EVSYS" value="0x00"/>
        <value caption="XCL selected as source" name="XCL" value="0x01"/>
        <value caption="LSB port pin selected as source" name="PINL" value="0x02"/>
        <value caption="MSB port pin selected as source" name="PINH" value="0x03"/>
      </value-group>
      <value-group caption="Delay Configuration on LUT" name="XCL_DLYCONF">
        <value caption="Delay element disabled" name="DISABLE" value="0x00"/>
        <value caption="Delay enabled on LUT input" name="IN" value="0x01"/>
        <value caption="Delay enabled on LUT output" name="OUT" value="0x02"/>
      </value-group>
      <value-group caption="Delay Selection" name="XCL_DLYSEL">
        <value caption="One cycle delay for each LUT1 and LUT0" name="DLY11" value="0x00"/>
        <value caption="One cycle delay for LUT1 and two cycles for LUT0" name="DLY12" value="0x01"/>
        <value caption="Two cycles delay for LUT1 and one cycle for LUT0" name="DLY21" value="0x02"/>
        <value caption="Two cycle delays for each LUT1 and LUT0" name="DLY22" value="0x03"/>
      </value-group>
      <value-group caption="Clock Selection" name="XCL_CLKSEL">
        <value caption="OFF" name="OFF" value="0x00"/>
        <value caption="Prescaler clk" name="DIV1" value="0x01"/>
        <value caption="Prescaler clk/2" name="DIV2" value="0x02"/>
        <value caption="Prescaler clk/4" name="DIV4" value="0x03"/>
        <value caption="Prescaler clk/8" name="DIV8" value="0x04"/>
        <value caption="Prescaler clk/64" name="DIV64" value="0x05"/>
        <value caption="Prescaler clk/256" name="DIV256" value="0x06"/>
        <value caption="Prescaler clk/1024" name="DIV1024" value="0x07"/>
        <value caption="Event channel 0" name="EVCH0" value="0x08"/>
        <value caption="Event channel 1" name="EVCH1" value="0x09"/>
        <value caption="Event channel 2" name="EVCH2" value="0x0A"/>
        <value caption="Event channel 3" name="EVCH3" value="0x0B"/>
        <value caption="Event channel 4" name="EVCH4" value="0x0C"/>
        <value caption="Event channel 5" name="EVCH5" value="0x0D"/>
        <value caption="Event channel 6" name="EVCH6" value="0x0E"/>
        <value caption="Event channel 7" name="EVCH7" value="0x0F"/>
      </value-group>
      <value-group caption="Timer/Counter Command Selection" name="XCL_CMDSEL">
        <value caption="None" name="NONE" value="0x00"/>
        <value caption="Force restart" name="RESTART" value="0x01"/>
      </value-group>
      <value-group caption="Timer/Counter Selection" name="XCL_TCSEL">
        <value caption="16-bit timer/counter" name="TC16" value="0x00"/>
        <value caption="One 8-bit timer/counter" name="BTC0" value="0x01"/>
        <value caption="Two 8-bit timer/counters" name="BTC01" value="0x02"/>
        <value caption="One 8-bit timer/counter and one 8-bit peripheral transmitter counter" name="BTC0PEC1" value="0x03"/>
        <value caption="One 8-bit timer/counter and one 8-bit peripheral receiver counter" name="PEC0BTC1" value="0x04"/>
        <value caption="Two 8-bit peripheral counters" name="PEC01" value="0x05"/>
        <value caption="One 8-bit timer/counter and two 4-bit peripheral counters" name="BTC0PEC2" value="0x06"/>
      </value-group>
      <value-group caption="Timer/Counter Mode" name="XCL_TCMODE">
        <value caption="Normal mode with compare/period" name="NORMAL" value="0x00"/>
        <value caption="Capture mode" name="CAPT" value="0x01"/>
        <value caption="Single Slope PWM" name="PWM" value="0x02"/>
        <value caption="One-shot PWM" name="1SHOT" value="0x03"/>		
      </value-group>
