avr-rust/avrd/packs/xmegae/ATxmega8E5.atdf
      <value-group caption="Compare Output Value Timer" name="XCL_CMPEN">
        <value caption="Clear WG Output " name="CLEAR" value="0x00"/>
        <value caption="Set WG Output " name="SET" value="0x01"/>
      </value-group>
      <value-group caption="Command Enable" name="XCL_CMDEN">
        <value caption="Command Ignored" name="DISABLE" value="0x00"/>
        <value caption="Command valid for timer/counter 0" name="CMD0" value="0x01"/>
        <value caption="Command valid for timer/counter 1" name="CMD1" value="0x02"/>
        <value caption="Command valid for both timer/counter 0 and 1" name="CMD01" value="0x03"/>
      </value-group>
      <value-group caption="Timer/Counter Event Source Selection" name="XCL_EVSRC">
        <value caption="Event channel 0" name="EVCH0" value="0x00"/>
        <value caption="Event channel 1" name="EVCH1" value="0x01"/>
        <value caption="Event channel 2" name="EVCH2" value="0x02"/>
        <value caption="Event channel 3" name="EVCH3" value="0x03"/>
        <value caption="Event channel 4" name="EVCH4" value="0x04"/>
        <value caption="Event channel 5" name="EVCH5" value="0x05"/>
        <value caption="Event channel 6" name="EVCH6" value="0x06"/>
        <value caption="Event channel 7" name="EVCH7" value="0x07"/>
      </value-group>
      <value-group caption="Timer/Counter Event Action Selection" name="XCL_EVACT">
        <value caption="Input Capture" name="INPUT" value="0x00"/>
        <value caption="Frequency Capture" name="FREQ" value="0x01"/>
        <value caption="Pulse Width Capture" name="PW" value="0x02"/>
        <value caption="Restart timer/counter" name="RESTART" value="0x03"/>
      </value-group>
      <value-group caption="Underflow Interrupt level" name="XCL_UNF_INTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Compare/Capture Interrupt level" name="XCL_CC_INTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <interrupt-group name="XCL">
        <interrupt index="0" name="UNF" caption="Timer/Counter Underflow Interrupt"/>
        <interrupt index="1" name="CC" caption="Timer/Counter Compare or Capture Interrupt"/>
      </interrupt-group>
    </module>
    <module name="TWI" id="I6089" version="XMEGAE" caption="Two-Wire Interface">
      <register-group caption="Two-Wire Interface" name="TWI" size="14">
        <register caption="TWI Common Control Register" name="CTRL" offset="0x00" size="1">
          <bitfield caption="Bridge Enable" mask="0x80" name="BRIDGEEN"/>
          <bitfield caption="Slave Fast Mode Plus Enable" mask="0x40" name="SFMPEN"/>
          <bitfield caption="Slave SDA Hold Time Enable" mask="0x30" name="SSDAHOLD" values="TWI_SDAHOLD"/>
          <bitfield caption="FMPLUS Enable" mask="0x08" name="FMPEN"/>
          <bitfield caption="SDA Hold Time Enable" mask="0x06" name="SDAHOLD" values="TWI_SDAHOLD"/>
          <bitfield caption="External Driver Interface Enable" mask="0x01" name="EDIEN"/>
        </register>
        <register-group caption="TWI master module" name="MASTER" offset="0x0001" name-in-module="TWI_MASTER"/>
        <register-group caption="TWI slave module" name="SLAVE" offset="0x0008" name-in-module="TWI_SLAVE"/>
        <register-group caption="TWI SMBUS timeout module" name="TIMEOUT" offset="0x000E" name-in-module="TWI_TIMEOUT"/></register-group>
      <register-group caption="" name="TWI_MASTER" size="7">
        <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Interrupt Level" mask="0xC0" name="INTLVL" values="TWI_MASTER_INTLVL"/>
          <bitfield caption="Read Interrupt Enable" mask="0x20" name="RIEN"/>
          <bitfield caption="Write Interrupt Enable" mask="0x10" name="WIEN"/>
          <bitfield caption="Enable TWI Master" mask="0x08" name="ENABLE"/>
        </register>
        <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Inactive Bus Timeout" mask="0x0C" name="TIMEOUT" values="TWI_MASTER_TIMEOUT"/>
          <bitfield caption="Quick Command Enable" mask="0x02" name="QCEN"/>
          <bitfield caption="Smart Mode Enable" mask="0x01" name="SMEN"/>
          <bitfield caption="Ttimeout Enable" mask="0x10" name="TTOUTEN"/>
          <bitfield caption="Slave Extend Timeout Enable" mask="0x20" name="TSEXTEN"/>
          <bitfield caption="Master Extend Timeout Enable" mask="0x40" name="TMEXTEN"/>
          <bitfield caption="Timeout Interrupt Enable" mask="0x80" name="TOIE"/>
        </register>
        <register caption="Control Register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Acknowledge Action" mask="0x04" name="ACKACT"/>
          <bitfield caption="Command" mask="0x03" name="CMD" values="TWI_MASTER_CMD"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x03" size="1">
          <bitfield caption="Read Interrupt Flag" mask="0x80" name="RIF"/>
          <bitfield caption="Write Interrupt Flag" mask="0x40" name="WIF"/>
          <bitfield caption="Clock Hold" mask="0x20" name="CLKHOLD"/>
          <bitfield caption="Received Acknowledge" mask="0x10" name="RXACK"/>
          <bitfield caption="Arbitration Lost" mask="0x08" name="ARBLOST"/>
          <bitfield caption="Bus Error" mask="0x04" name="BUSERR"/>
          <bitfield caption="Bus State" mask="0x03" name="BUSSTATE" values="TWI_MASTER_BUSSTATE"/>
        </register>
        <register caption="Baurd Rate Control Register" name="BAUD" offset="0x04" size="1"/>
