avr-rust/avrd/packs/xmegae/ATxmega8E5.atdf
        <register caption="Control register C" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Channel D Output Polarity" mask="0x80" name="POLD"/>
          <bitfield caption="Channel C Output Polarity" mask="0x40" name="POLC"/>
          <bitfield caption="Channel B Output Polarity" mask="0x20" name="POLB"/>
          <bitfield caption="Channel A Output Polarity" mask="0x10" name="POLA"/>
          <bitfield caption="Channel D Compare Output Value" mask="0x08" name="CMPD"/>
          <bitfield caption="Channel C Compare Output Value" mask="0x04" name="CMPC"/>
          <bitfield caption="Channel B Compare Output Value" mask="0x02" name="CMPB"/>
          <bitfield caption="Channel A Compare Output Value" mask="0x01" name="CMPA"/>
          <bitfield caption="High Channel D Compare Output Value" mask="0x80" name="HCMPD"/>
          <bitfield caption="High Channel C Compare Output Value" mask="0x40" name="HCMPC"/>
          <bitfield caption="High Channel B Compare Output Value" mask="0x20" name="HCMPB"/>
          <bitfield caption="High Channel A Compare Output Value" mask="0x10" name="HCMPA"/>
          <bitfield caption="Low Channel D Compare Output Value" mask="0x08" name="LCMPD"/>
          <bitfield caption="Low Channel C Compare Output Value" mask="0x04" name="LCMPC"/>
          <bitfield caption="Low Channel B Compare Output Value" mask="0x02" name="LCMPB"/>
          <bitfield caption="Low Channel A Compare Output Value" mask="0x01" name="LCMPA"/>
        </register>
        <register caption="Control Register D" name="CTRLD" offset="0x03" size="1">
          <bitfield caption="Event Action" mask="0xE0" name="EVACT" values="TC45_EVACT"/>
          <bitfield caption="Event Delay" mask="0x10" name="EVDLY"/>
          <bitfield caption="Event Source Select" mask="0x0F" name="EVSEL" values="TC45_EVSEL"/>
        </register>
        <register caption="Control Register E" name="CTRLE" offset="0x04" size="1">
          <bitfield caption="Channel D Compare or Capture Mode" mask="0xC0" name="CCDMODE" values="TC45_CCDMODE"/>
          <bitfield caption="Channel C Compare or Capture Mode" mask="0x30" name="CCCMODE" values="TC45_CCCMODE"/>
          <bitfield caption="Channel B Compare or Capture Mode" mask="0x0C" name="CCBMODE" values="TC45_CCBMODE"/>
          <bitfield caption="Channel A Compare or Capture Mode" mask="0x03" name="CCAMODE" values="TC45_CCAMODE"/>
          <bitfield caption="Channel Low D Compare or Capture Mode" mask="0xC0" name="LCCDMODE" values="TC45_LCCDMODE"/>
          <bitfield caption="Channel Low C Compare or Capture Mode" mask="0x30" name="LCCCMODE" values="TC45_LCCCMODE"/>
          <bitfield caption="Channel Low B Compare or Capture Mode" mask="0x0C" name="LCCBMODE" values="TC45_LCCBMODE"/>
          <bitfield caption="Channel Low A Compare or Capture Mode" mask="0x03" name="LCCAMODE" values="TC45_LCCAMODE"/>
        </register>
        <register caption="Control Register F" name="CTRLF" offset="0x05" size="1">
          <bitfield caption="Channel High D Compare or Capture Mode" mask="0xC0" name="HCCDMODE" values="TC45_HCCDMODE"/>
          <bitfield caption="Channel High C Compare or Capture Mode" mask="0x30" name="HCCCMODE" values="TC45_HCCCMODE"/>
          <bitfield caption="Channel High B Compare or Capture Mode" mask="0x0C" name="HCCBMODE" values="TC45_HCCBMODE"/>
          <bitfield caption="Channel High A Compare or Capture Mode" mask="0x03" name="HCCAMODE" values="TC45_HCCAMODE"/>
        </register>
        <register caption="Interrupt Control Register A" name="INTCTRLA" offset="0x06" size="1">
          <bitfield caption="Timer Trigger Restart Interrupt Level" mask="0x30" name="TRGINTLVL" values="TC45_TRGINTLVL"/>
          <bitfield caption="Timer Error Interrupt Level" mask="0x0C" name="ERRINTLVL" values="TC45_ERRINTLVL"/>
          <bitfield caption="Timer Overflow/Underflow Interrupt Level" mask="0x03" name="OVFINTLVL" values="TC45_OVFINTLVL"/>
        </register>
        <register caption="Interrupt Control Register B" name="INTCTRLB" offset="0x07" size="1">
          <bitfield caption="Channel D Compare or Capture Interrupt Level" mask="0xC0" name="CCDINTLVL" values="TC45_CCDINTLVL"/>
          <bitfield caption="Channel C Compare or Capture Interrupt Level" mask="0x30" name="CCCINTLVL" values="TC45_CCCINTLVL"/>
          <bitfield caption="Channel B Compare or Capture Interrupt Level" mask="0x0C" name="CCBINTLVL" values="TC45_CCBINTLVL"/>
          <bitfield caption="Channel A Compare or Capture Interrupt Level" mask="0x03" name="CCAINTLVL" values="TC45_CCAINTLVL"/>
          <bitfield caption="Channel Low D Compare or Capture Interrupt Level" mask="0xC0" name="LCCDINTLVL" values="TC45_LCCDINTLVL"/>
          <bitfield caption="Channel Low C Compare or Capture Interrupt Level" mask="0x30" name="LCCCINTLVL" values="TC45_LCCCINTLVL"/>
          <bitfield caption="Channel Low B Compare or Capture Interrupt Level" mask="0x0C" name="LCCBINTLVL" values="TC45_LCCBINTLVL"/>
          <bitfield caption="Channel Low A Compare or Capture Interrupt Level" mask="0x03" name="LCCAINTLVL" values="TC45_LCCAINTLVL"/>
        </register>
        <register caption="Control Register G Clear" name="CTRLGCLR" offset="0x08" size="1">
          <bitfield caption="Timer/Counter Stop" mask="0x20" name="STOP"/>
          <bitfield caption="Command" mask="0x0C" name="CMD" values="TC45_CMD"/>
          <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
          <bitfield caption="Counter Direction" mask="0x01" name="DIR"/>
        </register>
        <register caption="Control Register G Set" name="CTRLGSET" offset="0x09" size="1">
          <bitfield caption="Timer/Counter Stop" mask="0x20" name="STOP"/>
          <bitfield caption="Command" mask="0x0C" name="CMD" values="TC45_CMD"/>
          <bitfield caption="Lock Update" mask="0x02" name="LUPD"/>
          <bitfield caption="Counter Direction" mask="0x01" name="DIR"/>
        </register>
        <register caption="Control Register H Clear" name="CTRLHCLR" offset="0x0A" size="1">
          <bitfield caption="Channel D Compare or Capture Buffer Valid" mask="0x10" name="CCDBV"/>
          <bitfield caption="Channel C Compare or Capture Buffer Valid" mask="0x08" name="CCCBV"/>
          <bitfield caption="Channel B Compare or Capture Buffer Valid" mask="0x04" name="CCBBV"/>
          <bitfield caption="Channel A Compare or Capture Buffer Valid" mask="0x02" name="CCABV"/>
          <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
          <bitfield caption="Channel Low D Compare or Capture Buffer Valid" mask="0x10" name="LCCDBV"/>
          <bitfield caption="Channel Low C Compare or Capture Buffer Valid" mask="0x08" name="LCCCBV"/>
          <bitfield caption="Channel Low B Compare or Capture Buffer Valid" mask="0x04" name="LCCBBV"/>
          <bitfield caption="Channel Low A Compare or Capture Buffer Valid" mask="0x02" name="LCCABV"/>
          <bitfield caption="Period Low Buffer Valid" mask="0x01" name="LPERBV"/>
        </register>
        <register caption="Control Register H Set" name="CTRLHSET" offset="0x0B" size="1">
          <bitfield caption="Channel D Compare or Capture Buffer Valid" mask="0x10" name="CCDBV"/>
          <bitfield caption="Channel C Compare or Capture Buffer Valid" mask="0x08" name="CCCBV"/>
          <bitfield caption="Channel B Compare or Capture Buffer Valid" mask="0x04" name="CCBBV"/>
          <bitfield caption="Channel A Compare or Capture Buffer Valid" mask="0x02" name="CCABV"/>
          <bitfield caption="Period Buffer Valid" mask="0x01" name="PERBV"/>
          <bitfield caption="Channel Low D Compare or Capture Buffer Valid" mask="0x10" name="LCCDBV"/>
          <bitfield caption="Channel Low C Compare or Capture Buffer Valid" mask="0x08" name="LCCCBV"/>
          <bitfield caption="Channel Low B Compare or Capture Buffer Valid" mask="0x04" name="LCCBBV"/>
          <bitfield caption="Channel Low A Compare or Capture Buffer Valid" mask="0x02" name="LCCABV"/>
          <bitfield caption="Period Low Buffer Valid" mask="0x01" name="LPERBV"/>
        </register>
