avr-rust/avrd/packs/xmegae/ATxmega8E5.atdf
      <value-group caption="Compare or Capture Channel C Interrupt Level" name="TC45_CCCINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Compare or Capture Channel D Interrupt Level" name="TC45_CCDINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Compare or Capture Low Channel A Interrupt Level" name="TC45_LCCAINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Compare or Capture Low Channel B Interrupt Level" name="TC45_LCCBINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Compare or Capture Low Channel C Interrupt Level" name="TC45_LCCCINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Compare or Capture Low Channel D Interrupt Level" name="TC45_LCCDINTLVL">
        <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
        <value caption="Low Level" name="LO" value="0x01"/>
        <value caption="Medium Level" name="MED" value="0x02"/>
        <value caption="High Level" name="HI" value="0x03"/>
      </value-group>
      <value-group caption="Timer/Counter Command" name="TC45_CMD">
        <value caption="No Command" name="NONE" value="0x00"/>
        <value caption="Force Update" name="UPDATE" value="0x01"/>
        <value caption="Force Restart" name="RESTART" value="0x02"/>
        <value caption="Force Hard Reset" name="RESET" value="0x03"/>
      </value-group>
      <interrupt-group name="TC4">
        <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
        <interrupt index="1" name="ERR" caption="Error Interrupt"/>
        <interrupt index="2" name="CCA" caption="Channel A Compare or Capture Interrupt"/>
        <interrupt index="3" name="CCB" caption="Channel B Compare or Capture Interrupt"/>
        <interrupt index="4" name="CCC" caption="Channel C Compare or Capture Interrupt"/>
        <interrupt index="5" name="CCD" caption="Channel D Compare or Capture Interrupt"/>
      </interrupt-group>
      <interrupt-group name="TC5">
        <interrupt index="0" name="OVF" caption="Overflow Interrupt"/>
        <interrupt index="1" name="ERR" caption="Error Interrupt"/>
        <interrupt index="2" name="CCA" caption="Channel A Compare or Capture Interrupt"/>
        <interrupt index="3" name="CCB" caption="Channel B Compare or Capture Interrupt"/>
      </interrupt-group>
    </module>
    <module name="FAULT" id="I3620" version="XMEGAE" caption="Fault Extension">
      <register-group caption="Fault Extension" name="FAULT" size="8">
        <register caption="Control A Register" name="CTRLA" offset="0x00" size="1">
          <bitfield caption="Ramp Mode Selection" mask="0xC0" name="RAMP" values="FAULT_RAMP"/>
          <bitfield caption="Fault on Debug Break Detection" mask="0x20" name="FDDBD"/>
          <bitfield caption="Port Control Mode" mask="0x10" name="PORTCTRL"/>
          <bitfield caption="Fuse State " mask="0x08" name="FUSE"/>
          <bitfield caption="Fault E Digital Filter Selection" mask="0x04" name="FILTERE"/>
          <bitfield caption="Fault E Input selection" mask="0x03" name="SRCE" values="FAULT_SRCE"/>
        </register>
        <register caption="Control B Register" name="CTRLB" offset="0x01" size="1">
          <bitfield caption="Fault A Software Mode" mask="0x80" name="SOFTA"/>
          <bitfield caption="Fault A Halt Action" mask="0x60" name="HALTA" values="FAULT_HALTA"/>
          <bitfield caption="Fault A Restart Action" mask="0x10" name="RESTARTA"/>
          <bitfield caption="Fault A Keep Action" mask="0x08" name="KEEPA"/>
          <bitfield caption="Fault A Source Selection" mask="0x03" name="SRCA" values="FAULT_SRCA"/>
        </register>
        <register caption="Control C Register" name="CTRLC" offset="0x02" size="1">
          <bitfield caption="Fault A Capture" mask="0x20" name="CAPTA"/>
          <bitfield caption="Fault A Digital Filter Selection" mask="0x04" name="FILTERA"/>
          <bitfield caption="Fault A Blanking" mask="0x02" name="BLANKA"/>
          <bitfield caption="Fault A Qualification" mask="0x01" name="QUALA"/>
        </register>
        <register caption="Control D Register" name="CTRLD" offset="0x03" size="1">
          <bitfield caption="Fault B Software Mode" mask="0x80" name="SOFTB"/>
          <bitfield caption="Fault B Halt Action" mask="0x60" name="HALTB" values="FAULT_HALTB"/>
          <bitfield caption="Fault B Restart Action" mask="0x10" name="RESTARTB"/>
          <bitfield caption="Fault B Keep Action" mask="0x08" name="KEEPB"/>
          <bitfield caption="Fault B Source Selection" mask="0x03" name="SRCB" values="FAULT_SRCB"/>
        </register>
        <register caption="Control E Register" name="CTRLE" offset="0x04" size="1">
          <bitfield caption="Fault B Capture" mask="0x20" name="CAPTB"/>
          <bitfield caption="Fault B Digital Filter Selection" mask="0x04" name="FILTERB"/>
          <bitfield caption="Fault B Blanking" mask="0x02" name="BLANKB"/>
          <bitfield caption="Fault B Qualification" mask="0x01" name="QUALB"/>
        </register>
        <register caption="Status Register" name="STATUS" offset="0x05" size="1">
          <bitfield caption="Fault B State" mask="0x80" name="STATEB"/>
          <bitfield caption="Fault A State" mask="0x40" name="STATEA"/>
          <bitfield caption="Fault E State" mask="0x20" name="STATEE"/>
          <bitfield caption="Channel Index Flag" mask="0x08" name="IDX"/>
          <bitfield caption="Fault B Flag" mask="0x04" name="FAULTBIN"/>
          <bitfield caption="Fault A Flag" mask="0x02" name="FAULTAIN"/>
          <bitfield caption="Fault E Flag" mask="0x01" name="FAULTEIN"/>
        </register>
